app/views/users/show.html.erb

SELECT  1 AS one FROM "gardens" WHERE "gardens"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "gardens".* FROM "gardens"
---
<div class='gardens'>
<% if current_user.gardens.any? %>

SELECT "plants".* FROM "plants" WHERE "plants"."garden_id" = $1  [["garden_id", 1]]
---
      <p>Current Plants in Garden:</p>
      <%= "#{garden.plants.map {|plant| plant.name}.uniq.join(", ")}" %><br>