app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "111848931496290675316"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 AND "users"."id" != $2 LIMIT $3  [["email", "mlynch5187@gmail.com"], ["id", 1], ["LIMIT", 1]]
INSERT INTO "users" ("email", "google_token", "google_refresh_token", "created_at", "updated_at", "uid") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "google_token" = $1, "google_refresh_token" = $2, "updated_at" = $3 WHERE "users"."id" = $4
---
  def create
    access_token = request.env['omniauth.auth']
    user = User.from_omniauth(access_token)
    user.google_token = access_token.credentials.token
    user.email = access_token.info.name
    refresh_token = access_token.credentials.refresh_token
    user.google_refresh_token = refresh_token if refresh_token.present?
    user.save