app/controllers/users/gardens_controller.rb

SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT distinct on (name) * FROM "plants" WHERE "plants"."garden_id" = $1  [["garden_id", 1]]
---
  def show
    @garden = Garden.find(params[:id])
    @plants = @garden.plants.select('distinct on (name) *')

INSERT INTO "gardens" ("name", "length_cm", "width_cm", "zip_code", "user_id", "created_at", "updated_at", "light") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    current_user.gardens.create(
      name: garden_params[:name],
      length_cm: ((garden_params[:length_feet].to_i * 12) + garden_params[:length_inches].to_i) * 2.54,
      width_cm: ((garden_params[:width_feet].to_i * 12) + garden_params[:width_inches].to_i) * 2.54,
      zip_code: garden_params[:zip_code],
      light: garden_params[:light]
    )