app/controllers/users/plants_controller.rb

  def new
    @garden = Garden.find(params[:garden_id])
---
SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @garden = Garden.find(params[:garden_id])
---
SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def plot
    @garden = Garden.find(params[:garden_id])
---
SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def increase
    garden = Garden.find(params[:garden_id])
---
SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def decrease
    garden = Garden.find(params[:garden_id])
---
SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new_garden
    garden = Garden.find(params[:garden_id])
    plants = PlantObject.plant_details(session[:plants])
    plants.each do |plant|
      garden.plants.create(
        trefle_id: plant.id,
        name: plant.name,
        row_spacing: plant.row_spacing,
        spread: plant.spread,
        edible: plant.edible,
        image: plant.images[:flower][0][:image_url],
        light: plant.light,
        ph_min: plant.ph_min,
        ph_max: plant.ph_max,
        days_to_harvest: plant.days_to_harvest,
        min_temp: plant.min_temp,
        max_temp: plant.max_temp,
        link_to_show_page: plant.link_to_show_page,
        quantity: session[:plant_quantity][plant.id.to_s]
      )
---
SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "plants" ("name", "garden_id", "created_at", "updated_at", "quantity", "trefle_id", "row_spacing", "spread", "edible", "image", "light", "ph_min", "ph_max", "link_to_show_page") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"